L = list(range(10))
print(L)

print(L[1:5])              # 인덱스 1~4까지 슬라이싱 → [1,2,3,4]
print(L[1::3])             # 인덱스 1부터 시작, 3칸씩 건너뛰며 출력 → [1,4,7]
print(L[5:])               # 인덱스 5부터 끝까지 출력 → [5,6,7,8,9]
print(L[:5])               # 처음부터 인덱스 4까지 출력 → [0,1,2,3,4]
print(L[::2])              # 처음부터 끝까지 2칸씩 건너뛰며 출력 → [0,2,4,6,8]
print(L[::-2])             # 역순으로 2칸씩 건너뛰며 출력 → [9,7,5,3,1]

print(3 in L) # True
print(30 in L) # False

L=['apple', 'banana', 100, 200] # 리스트 : 여러 타입 기입가능

L[1]=9

L[1:1]=[9] # (값 끼워넣기)

L[1:2]=[1,2,3,4,5] # (값 변경)

L[1] = [1,2,3,4,5] # 1번 인덱스에 리스트삽입(2차원 배열)

L[1:2]=[50] # 1번 인덱스 50으로 변경
L[1] = 50

L[1] = 'orange'
L[1:2] = ['orange']
print(L)

L[0:2] = []         # 인덱스 0~1('apple','orange') 삭제

L[4:] = [77]         # 인덱스 4부터 끝까지를 [77]로 대체

del[L[2]]            # 인덱스 2 요소(5) 삭제
print(L)

L2 = L
print(f"L2 (2번 인덱스 변경 전): {L2}")
L2[2] = 99
print(f"L2 (2번 인덱스 변경 후) : {L2}") # [2, 3, 99, 77]
print(f"L (2번 인덱스 변경 후): {L}") # [2, 3, 99, 77]